src/test/resources/betamax/tapes/Payments/can_create.yaml

name: can_create
interactions:
- request:
    method: POST
    uri: http://localhost:5555/v2/payments/create
    body: currency=EUR&beneficiary_id=60fbe8d3-f7d0-4124-9077-93d09fb2186a&amount=788.44&reason=Invoice&reference=REF-INV-1838&unique_request_id=a20bc586-b7a9-4316-9daf-d4ede4c0d4ee
    headers:
      X-Auth-Token:
      - 6f5f99d1b860fc47e8a186e3dce0d3f9
      User-Agent:
      - CurrencyCloudSDK/2.0 Java/1.8.1
  response:
    status: 200
    headers:
      Server:
      - nginx
      Date:
      - Mon, 01 Jan 2018 12:34:56 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '852'
      Connection:
      - keep-alive
      X-Request-Id:
      - '2778807612227406608'
      X-Content-Type-Options:
      - nosniff
    body: '{"id":"778d2ba2-b2ec-4b39-b54c-0c3410525c97","amount":"788.44","beneficiary_id":"60fbe8d3-f7d0-4124-9077-93d09fb2186a","currency":"EUR",
    "reference":"REF-INV-1838","reason":"Invoice","status":"ready_to_send","creator_contact_id":"a66ca63f-e668-47af-8bb9-74363240d781","payment_type":"regular",
    "payment_date":"2018-01-01","transferred_at":"","authorisation_steps_required":"0","last_updater_contact_id":"a66ca63f-e668-47af-8bb9-74363240d781",
    "short_reference":"180925-BXRBZZ001","conversion_id":null,"failure_reason":"","payer_id":"68561f01-b5d8-4fad-9bcb-d1712a1bc0c8","payer_details_source":"account",
    "created_at":"2018-01-01T12:34:56+00:00","updated_at":"2018-01-01T12:34:56+00:00","payment_group_id":null,"unique_request_id":"a20bc586-b7a9-4316-9daf-d4ede4c0d4ee",
    "failure_returned_amount":"0.00","ultimate_beneficiary_name":null,"purpose_code":null}'
