src/test/resources/betamax/tapes/Payments/can_get_quote_payment_fee.yaml

name: can_get_payment_delivery_date
interactions:
  - request:
      method: GET
      uri: http://localhost:5555/v2/payments/quote_payment_fee?payment_currency=USD&payment_destination_country=US&payment_type=regular
      body: ''
      headers:
        X-Auth-Token:
          - 1c9da5726314246acfb09ec5651307a5
        User-Agent:
          - CurrencyCloudSDK/2.0 Java/3.6.1
    response:
      status: 200
      headers:
        Server:
          - nginx
        Date:
          - Wed, 29 Apr 2015 21:04:08 GMT
        Content-Type:
          - application/json;charset=utf-8
        Connection:
          - keep-alive
        X-Request-Id:
          - '2775201676418056015'
        X-Content-Type-Options:
          - nosniff
      body: '{
               "account_id": "0534aaf2-2egg-0134-2f36-10b11cd33cfb",
               "payment_currency": "USD",
               "payment_destination_country": "US",
               "payment_type": "regular",
               "charge_type": null,
               "fee_amount": "10.00",
               "fee_currency": "EUR"
             }'
